; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 275013 2 3 4 7 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	spectrograph0 - mode
	image3 - mode
	spectrograph2 - mode
	spectrograph1 - mode
	GroundStation1 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	Star0 - direction
	GroundStation6 - direction
	Star4 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star4)
	(supports instrument1 spectrograph0)
	(supports instrument1 image3)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 image3)
	(supports instrument3 spectrograph2)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 Star0)
	(supports instrument4 spectrograph2)
	(supports instrument4 image3)
	(calibration_target instrument4 Star4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
)
(:goal (and
	(pointing satellite0 Planet7)
	(have_image Planet7 spectrograph0)
	(have_image Star8 spectrograph1)
	(have_image Star9 spectrograph1)
	(have_image Star10 spectrograph0)
	(have_image Planet11 image3)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (turn_to satellite1 star9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star9)
   goals met: 0 of 6
4. (turn_to satellite0 star10 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star10)
   goals met: 0 of 6
5. (turn_to satellite0 star0 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star0)
   goals met: 0 of 6
6. (turn_to satellite1 groundstation2 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 6
7. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 6
8. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 6
9. (turn_to satellite0 planet11 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet11)
   goals met: 0 of 6
10. (turn_to satellite1 star9 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star9)
   goals met: 0 of 6
11. (take_image satellite0 planet11 instrument1 image3)
   added: (have_image planet11 image3)
   goals met: 1 of 6
12. (take_image satellite1 star9 instrument2 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 2 of 6
13. (turn_to satellite0 star10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star10)
   goals met: 2 of 6
14. (turn_to satellite1 star8 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star8)
   goals met: 2 of 6
15. (take_image satellite0 star10 instrument1 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 3 of 6
16. (take_image satellite1 star8 instrument2 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 4 of 6
17. (turn_to satellite0 planet7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet7)
   goals met: 5 of 6
18. (take_image satellite0 planet7 instrument1 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 6 of 6
